zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg41/pio/pic32cx1025sg41064.h
#define PIN_PB01B_ADC0_AIN13                       _UINT32_(33)
#define MUX_PB01B_ADC0_AIN13                       _UINT32_(1) 
#define PINMUX_PB01B_ADC0_AIN13                    ((PIN_PB01B_ADC0_AIN13 << 16) | MUX_PB01B_ADC0_AIN13)
#define PORT_PB01B_ADC0_AIN13                      (_UINT32_(1) << 1)

#define PIN_PB02B_ADC0_AIN14                       _UINT32_(34)
#define MUX_PB02B_ADC0_AIN14                       _UINT32_(1) 
#define PINMUX_PB02B_ADC0_AIN14                    ((PIN_PB02B_ADC0_AIN14 << 16) | MUX_PB02B_ADC0_AIN14)
#define PORT_PB02B_ADC0_AIN14                      (_UINT32_(1) << 2)

#define PIN_PB03B_ADC0_AIN15                       _UINT32_(35)
#define MUX_PB03B_ADC0_AIN15                       _UINT32_(1) 
#define PINMUX_PB03B_ADC0_AIN15                    ((PIN_PB03B_ADC0_AIN15 << 16) | MUX_PB03B_ADC0_AIN15)
#define PORT_PB03B_ADC0_AIN15                      (_UINT32_(1) << 3)

#define PIN_PA03B_ADC0_VREFA                       _UINT32_(3) 
#define MUX_PA03B_ADC0_VREFA                       _UINT32_(1) 
#define PINMUX_PA03B_ADC0_VREFA                    ((PIN_PA03B_ADC0_VREFA << 16) | MUX_PA03B_ADC0_VREFA)
#define PORT_PA03B_ADC0_VREFA                      (_UINT32_(1) << 3)

#define PIN_PA04B_ADC0_VREFB                       _UINT32_(4) 
#define MUX_PA04B_ADC0_VREFB                       _UINT32_(1) 
#define PINMUX_PA04B_ADC0_VREFB                    ((PIN_PA04B_ADC0_VREFB << 16) | MUX_PA04B_ADC0_VREFB)
#define PORT_PA04B_ADC0_VREFB                      (_UINT32_(1) << 4)

#define PIN_PA06B_ADC0_VREFC                       _UINT32_(6) 
#define MUX_PA06B_ADC0_VREFC                       _UINT32_(1) 
#define PINMUX_PA06B_ADC0_VREFC                    ((PIN_PA06B_ADC0_VREFC << 16) | MUX_PA06B_ADC0_VREFC)
#define PORT_PA06B_ADC0_VREFC                      (_UINT32_(1) << 6)

#define PIN_PA03B_ADC0_X0                          _UINT32_(3) 
#define MUX_PA03B_ADC0_X0                          _UINT32_(1) 
#define PINMUX_PA03B_ADC0_X0                       ((PIN_PA03B_ADC0_X0 << 16) | MUX_PA03B_ADC0_X0)
#define PORT_PA03B_ADC0_X0                         (_UINT32_(1) << 3)

#define PIN_PB08B_ADC0_X1                          _UINT32_(40)
#define MUX_PB08B_ADC0_X1                          _UINT32_(1) 
#define PINMUX_PB08B_ADC0_X1                       ((PIN_PB08B_ADC0_X1 << 16) | MUX_PB08B_ADC0_X1)
#define PORT_PB08B_ADC0_X1                         (_UINT32_(1) << 8)

#define PIN_PB09B_ADC0_X2                          _UINT32_(41)
#define MUX_PB09B_ADC0_X2                          _UINT32_(1) 
#define PINMUX_PB09B_ADC0_X2                       ((PIN_PB09B_ADC0_X2 << 16) | MUX_PB09B_ADC0_X2)
#define PORT_PB09B_ADC0_X2                         (_UINT32_(1) << 9)

#define PIN_PA04B_ADC0_X3                          _UINT32_(4) 
#define MUX_PA04B_ADC0_X3                          _UINT32_(1) 
#define PINMUX_PA04B_ADC0_X3                       ((PIN_PA04B_ADC0_X3 << 16) | MUX_PA04B_ADC0_X3)
#define PORT_PA04B_ADC0_X3                         (_UINT32_(1) << 4)

#define PIN_PA06B_ADC0_X4                          _UINT32_(6) 
#define MUX_PA06B_ADC0_X4                          _UINT32_(1) 
#define PINMUX_PA06B_ADC0_X4                       ((PIN_PA06B_ADC0_X4 << 16) | MUX_PA06B_ADC0_X4)
#define PORT_PA06B_ADC0_X4                         (_UINT32_(1) << 6)

#define PIN_PA07B_ADC0_X5                          _UINT32_(7) 
#define MUX_PA07B_ADC0_X5                          _UINT32_(1) 
#define PINMUX_PA07B_ADC0_X5                       ((PIN_PA07B_ADC0_X5 << 16) | MUX_PA07B_ADC0_X5)
#define PORT_PA07B_ADC0_X5                         (_UINT32_(1) << 7)

#define PIN_PA08B_ADC0_X6                          _UINT32_(8) 
#define MUX_PA08B_ADC0_X6                          _UINT32_(1) 
#define PINMUX_PA08B_ADC0_X6                       ((PIN_PA08B_ADC0_X6 << 16) | MUX_PA08B_ADC0_X6)
#define PORT_PA08B_ADC0_X6                         (_UINT32_(1) << 8)

#define PIN_PA09B_ADC0_X7                          _UINT32_(9) 
#define MUX_PA09B_ADC0_X7                          _UINT32_(1) 
#define PINMUX_PA09B_ADC0_X7                       ((PIN_PA09B_ADC0_X7 << 16) | MUX_PA09B_ADC0_X7)
#define PORT_PA09B_ADC0_X7                         (_UINT32_(1) << 9)

#define PIN_PA10B_ADC0_X8                          _UINT32_(10)
#define MUX_PA10B_ADC0_X8                          _UINT32_(1) 
#define PINMUX_PA10B_ADC0_X8                       ((PIN_PA10B_ADC0_X8 << 16) | MUX_PA10B_ADC0_X8)
#define PORT_PA10B_ADC0_X8                         (_UINT32_(1) << 10)

#define PIN_PA11B_ADC0_X9                          _UINT32_(11)
#define MUX_PA11B_ADC0_X9                          _UINT32_(1) 
#define PINMUX_PA11B_ADC0_X9                       ((PIN_PA11B_ADC0_X9 << 16) | MUX_PA11B_ADC0_X9)
#define PORT_PA11B_ADC0_X9                         (_UINT32_(1) << 11)

#define PIN_PA16B_ADC0_X10                         _UINT32_(16)
#define MUX_PA16B_ADC0_X10                         _UINT32_(1) 
#define PINMUX_PA16B_ADC0_X10                      ((PIN_PA16B_ADC0_X10 << 16) | MUX_PA16B_ADC0_X10)
#define PORT_PA16B_ADC0_X10                        (_UINT32_(1) << 16)

#define PIN_PA17B_ADC0_X11                         _UINT32_(17)
#define MUX_PA17B_ADC0_X11                         _UINT32_(1) 
#define PINMUX_PA17B_ADC0_X11                      ((PIN_PA17B_ADC0_X11 << 16) | MUX_PA17B_ADC0_X11)
#define PORT_PA17B_ADC0_X11                        (_UINT32_(1) << 17)

#define PIN_PA18B_ADC0_X12                         _UINT32_(18)
#define MUX_PA18B_ADC0_X12                         _UINT32_(1) 
#define PINMUX_PA18B_ADC0_X12                      ((PIN_PA18B_ADC0_X12 << 16) | MUX_PA18B_ADC0_X12)
#define PORT_PA18B_ADC0_X12                        (_UINT32_(1) << 18)

#define PIN_PA19B_ADC0_X13                         _UINT32_(19)
#define MUX_PA19B_ADC0_X13                         _UINT32_(1) 
#define PINMUX_PA19B_ADC0_X13                      ((PIN_PA19B_ADC0_X13 << 16) | MUX_PA19B_ADC0_X13)
#define PORT_PA19B_ADC0_X13                        (_UINT32_(1) << 19)

