zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg41/pio/pic32cx1025sg41064.h
#define PIN_PB05B_ADC1_AIN7                        _UINT32_(37)
#define MUX_PB05B_ADC1_AIN7                        _UINT32_(1) 
#define PINMUX_PB05B_ADC1_AIN7                     ((PIN_PB05B_ADC1_AIN7 << 16) | MUX_PB05B_ADC1_AIN7)
#define PORT_PB05B_ADC1_AIN7                       (_UINT32_(1) << 5)

#define PIN_PB06B_ADC1_AIN8                        _UINT32_(38)
#define MUX_PB06B_ADC1_AIN8                        _UINT32_(1) 
#define PINMUX_PB06B_ADC1_AIN8                     ((PIN_PB06B_ADC1_AIN8 << 16) | MUX_PB06B_ADC1_AIN8)
#define PORT_PB06B_ADC1_AIN8                       (_UINT32_(1) << 6)

#define PIN_PB07B_ADC1_AIN9                        _UINT32_(39)
#define MUX_PB07B_ADC1_AIN9                        _UINT32_(1) 
#define PINMUX_PB07B_ADC1_AIN9                     ((PIN_PB07B_ADC1_AIN9 << 16) | MUX_PB07B_ADC1_AIN9)
#define PORT_PB07B_ADC1_AIN9                       (_UINT32_(1) << 7)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04N_CCL_IN0                          _UINT32_(4) 
#define MUX_PA04N_CCL_IN0                          _UINT32_(13)
#define PINMUX_PA04N_CCL_IN0                       ((PIN_PA04N_CCL_IN0 << 16) | MUX_PA04N_CCL_IN0)
#define PORT_PA04N_CCL_IN0                         (_UINT32_(1) << 4)

#define PIN_PA16N_CCL_IN0                          _UINT32_(16)
#define MUX_PA16N_CCL_IN0                          _UINT32_(13)
#define PINMUX_PA16N_CCL_IN0                       ((PIN_PA16N_CCL_IN0 << 16) | MUX_PA16N_CCL_IN0)
#define PORT_PA16N_CCL_IN0                         (_UINT32_(1) << 16)

#define PIN_PB22N_CCL_IN0                          _UINT32_(54)
#define MUX_PB22N_CCL_IN0                          _UINT32_(13)
#define PINMUX_PB22N_CCL_IN0                       ((PIN_PB22N_CCL_IN0 << 16) | MUX_PB22N_CCL_IN0)
#define PORT_PB22N_CCL_IN0                         (_UINT32_(1) << 22)

#define PIN_PA05N_CCL_IN1                          _UINT32_(5) 
#define MUX_PA05N_CCL_IN1                          _UINT32_(13)
#define PINMUX_PA05N_CCL_IN1                       ((PIN_PA05N_CCL_IN1 << 16) | MUX_PA05N_CCL_IN1)
#define PORT_PA05N_CCL_IN1                         (_UINT32_(1) << 5)

#define PIN_PA17N_CCL_IN1                          _UINT32_(17)
#define MUX_PA17N_CCL_IN1                          _UINT32_(13)
#define PINMUX_PA17N_CCL_IN1                       ((PIN_PA17N_CCL_IN1 << 16) | MUX_PA17N_CCL_IN1)
#define PORT_PA17N_CCL_IN1                         (_UINT32_(1) << 17)

#define PIN_PB00N_CCL_IN1                          _UINT32_(32)
#define MUX_PB00N_CCL_IN1                          _UINT32_(13)
#define PINMUX_PB00N_CCL_IN1                       ((PIN_PB00N_CCL_IN1 << 16) | MUX_PB00N_CCL_IN1)
#define PORT_PB00N_CCL_IN1                         (_UINT32_(1) << 0)

#define PIN_PA06N_CCL_IN2                          _UINT32_(6) 
#define MUX_PA06N_CCL_IN2                          _UINT32_(13)
#define PINMUX_PA06N_CCL_IN2                       ((PIN_PA06N_CCL_IN2 << 16) | MUX_PA06N_CCL_IN2)
#define PORT_PA06N_CCL_IN2                         (_UINT32_(1) << 6)

#define PIN_PA18N_CCL_IN2                          _UINT32_(18)
#define MUX_PA18N_CCL_IN2                          _UINT32_(13)
#define PINMUX_PA18N_CCL_IN2                       ((PIN_PA18N_CCL_IN2 << 16) | MUX_PA18N_CCL_IN2)
#define PORT_PA18N_CCL_IN2                         (_UINT32_(1) << 18)

#define PIN_PB01N_CCL_IN2                          _UINT32_(33)
#define MUX_PB01N_CCL_IN2                          _UINT32_(13)
#define PINMUX_PB01N_CCL_IN2                       ((PIN_PB01N_CCL_IN2 << 16) | MUX_PB01N_CCL_IN2)
#define PORT_PB01N_CCL_IN2                         (_UINT32_(1) << 1)

#define PIN_PA08N_CCL_IN3                          _UINT32_(8) 
#define MUX_PA08N_CCL_IN3                          _UINT32_(13)
#define PINMUX_PA08N_CCL_IN3                       ((PIN_PA08N_CCL_IN3 << 16) | MUX_PA08N_CCL_IN3)
#define PORT_PA08N_CCL_IN3                         (_UINT32_(1) << 8)

#define PIN_PA30N_CCL_IN3                          _UINT32_(30)
#define MUX_PA30N_CCL_IN3                          _UINT32_(13)
#define PINMUX_PA30N_CCL_IN3                       ((PIN_PA30N_CCL_IN3 << 16) | MUX_PA30N_CCL_IN3)
#define PORT_PA30N_CCL_IN3                         (_UINT32_(1) << 30)

#define PIN_PA09N_CCL_IN4                          _UINT32_(9) 
#define MUX_PA09N_CCL_IN4                          _UINT32_(13)
#define PINMUX_PA09N_CCL_IN4                       ((PIN_PA09N_CCL_IN4 << 16) | MUX_PA09N_CCL_IN4)
#define PORT_PA09N_CCL_IN4                         (_UINT32_(1) << 9)

#define PIN_PA10N_CCL_IN5                          _UINT32_(10)
#define MUX_PA10N_CCL_IN5                          _UINT32_(13)
#define PINMUX_PA10N_CCL_IN5                       ((PIN_PA10N_CCL_IN5 << 16) | MUX_PA10N_CCL_IN5)
#define PORT_PA10N_CCL_IN5                         (_UINT32_(1) << 10)

#define PIN_PA22N_CCL_IN6                          _UINT32_(22)
#define MUX_PA22N_CCL_IN6                          _UINT32_(13)
#define PINMUX_PA22N_CCL_IN6                       ((PIN_PA22N_CCL_IN6 << 16) | MUX_PA22N_CCL_IN6)
#define PORT_PA22N_CCL_IN6                         (_UINT32_(1) << 22)

#define PIN_PB06N_CCL_IN6                          _UINT32_(38)
#define MUX_PB06N_CCL_IN6                          _UINT32_(13)
#define PINMUX_PB06N_CCL_IN6                       ((PIN_PB06N_CCL_IN6 << 16) | MUX_PB06N_CCL_IN6)
#define PORT_PB06N_CCL_IN6                         (_UINT32_(1) << 6)

#define PIN_PA23N_CCL_IN7                          _UINT32_(23)
#define MUX_PA23N_CCL_IN7                          _UINT32_(13)
#define PINMUX_PA23N_CCL_IN7                       ((PIN_PA23N_CCL_IN7 << 16) | MUX_PA23N_CCL_IN7)
#define PORT_PA23N_CCL_IN7                         (_UINT32_(1) << 23)

#define PIN_PB07N_CCL_IN7                          _UINT32_(39)
#define MUX_PB07N_CCL_IN7                          _UINT32_(13)
#define PINMUX_PB07N_CCL_IN7                       ((PIN_PB07N_CCL_IN7 << 16) | MUX_PB07N_CCL_IN7)
#define PORT_PB07N_CCL_IN7                         (_UINT32_(1) << 7)

#define PIN_PA24N_CCL_IN8                          _UINT32_(24)
#define MUX_PA24N_CCL_IN8                          _UINT32_(13)
#define PINMUX_PA24N_CCL_IN8                       ((PIN_PA24N_CCL_IN8 << 16) | MUX_PA24N_CCL_IN8)
#define PORT_PA24N_CCL_IN8                         (_UINT32_(1) << 24)

#define PIN_PB08N_CCL_IN8                          _UINT32_(40)
#define MUX_PB08N_CCL_IN8                          _UINT32_(13)
#define PINMUX_PB08N_CCL_IN8                       ((PIN_PB08N_CCL_IN8 << 16) | MUX_PB08N_CCL_IN8)
#define PORT_PB08N_CCL_IN8                         (_UINT32_(1) << 8)

