zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg41/pio/pic32cx1025sg41064.h
#define PIN_PA17K_PCC_DATA1                        _UINT32_(17)
#define MUX_PA17K_PCC_DATA1                        _UINT32_(10)
#define PINMUX_PA17K_PCC_DATA1                     ((PIN_PA17K_PCC_DATA1 << 16) | MUX_PA17K_PCC_DATA1)
#define PORT_PA17K_PCC_DATA1                       (_UINT32_(1) << 17)

#define PIN_PA18K_PCC_DATA2                        _UINT32_(18)
#define MUX_PA18K_PCC_DATA2                        _UINT32_(10)
#define PINMUX_PA18K_PCC_DATA2                     ((PIN_PA18K_PCC_DATA2 << 16) | MUX_PA18K_PCC_DATA2)
#define PORT_PA18K_PCC_DATA2                       (_UINT32_(1) << 18)

#define PIN_PA19K_PCC_DATA3                        _UINT32_(19)
#define MUX_PA19K_PCC_DATA3                        _UINT32_(10)
#define PINMUX_PA19K_PCC_DATA3                     ((PIN_PA19K_PCC_DATA3 << 16) | MUX_PA19K_PCC_DATA3)
#define PORT_PA19K_PCC_DATA3                       (_UINT32_(1) << 19)

#define PIN_PA20K_PCC_DATA4                        _UINT32_(20)
#define MUX_PA20K_PCC_DATA4                        _UINT32_(10)
#define PINMUX_PA20K_PCC_DATA4                     ((PIN_PA20K_PCC_DATA4 << 16) | MUX_PA20K_PCC_DATA4)
#define PORT_PA20K_PCC_DATA4                       (_UINT32_(1) << 20)

#define PIN_PA21K_PCC_DATA5                        _UINT32_(21)
#define MUX_PA21K_PCC_DATA5                        _UINT32_(10)
#define PINMUX_PA21K_PCC_DATA5                     ((PIN_PA21K_PCC_DATA5 << 16) | MUX_PA21K_PCC_DATA5)
#define PORT_PA21K_PCC_DATA5                       (_UINT32_(1) << 21)

#define PIN_PA22K_PCC_DATA6                        _UINT32_(22)
#define MUX_PA22K_PCC_DATA6                        _UINT32_(10)
#define PINMUX_PA22K_PCC_DATA6                     ((PIN_PA22K_PCC_DATA6 << 16) | MUX_PA22K_PCC_DATA6)
#define PORT_PA22K_PCC_DATA6                       (_UINT32_(1) << 22)

#define PIN_PA23K_PCC_DATA7                        _UINT32_(23)
#define MUX_PA23K_PCC_DATA7                        _UINT32_(10)
#define PINMUX_PA23K_PCC_DATA7                     ((PIN_PA23K_PCC_DATA7 << 16) | MUX_PA23K_PCC_DATA7)
#define PORT_PA23K_PCC_DATA7                       (_UINT32_(1) << 23)

#define PIN_PB14K_PCC_DATA8                        _UINT32_(46)
#define MUX_PB14K_PCC_DATA8                        _UINT32_(10)
#define PINMUX_PB14K_PCC_DATA8                     ((PIN_PB14K_PCC_DATA8 << 16) | MUX_PB14K_PCC_DATA8)
#define PORT_PB14K_PCC_DATA8                       (_UINT32_(1) << 14)

#define PIN_PB15K_PCC_DATA9                        _UINT32_(47)
#define MUX_PB15K_PCC_DATA9                        _UINT32_(10)
#define PINMUX_PB15K_PCC_DATA9                     ((PIN_PB15K_PCC_DATA9 << 16) | MUX_PB15K_PCC_DATA9)
#define PORT_PB15K_PCC_DATA9                       (_UINT32_(1) << 15)

#define PIN_PA12K_PCC_DEN1                         _UINT32_(12)
#define MUX_PA12K_PCC_DEN1                         _UINT32_(10)
#define PINMUX_PA12K_PCC_DEN1                      ((PIN_PA12K_PCC_DEN1 << 16) | MUX_PA12K_PCC_DEN1)
#define PORT_PA12K_PCC_DEN1                        (_UINT32_(1) << 12)

#define PIN_PA13K_PCC_DEN2                         _UINT32_(13)
#define MUX_PA13K_PCC_DEN2                         _UINT32_(10)
#define PINMUX_PA13K_PCC_DEN2                      ((PIN_PA13K_PCC_DEN2 << 16) | MUX_PA13K_PCC_DEN2)
#define PORT_PA13K_PCC_DEN2                        (_UINT32_(1) << 13)

/* ========== PORT definition for PDEC peripheral ========== */
#define PIN_PB23G_PDEC_QDI0                        _UINT32_(55)
#define MUX_PB23G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PB23G_PDEC_QDI0                     ((PIN_PB23G_PDEC_QDI0 << 16) | MUX_PB23G_PDEC_QDI0)
#define PORT_PB23G_PDEC_QDI0                       (_UINT32_(1) << 23)

#define PIN_PA24G_PDEC_QDI0                        _UINT32_(24)
#define MUX_PA24G_PDEC_QDI0                        _UINT32_(6) 
#define PINMUX_PA24G_PDEC_QDI0                     ((PIN_PA24G_PDEC_QDI0 << 16) | MUX_PA24G_PDEC_QDI0)
#define PORT_PA24G_PDEC_QDI0                       (_UINT32_(1) << 24)

#define PIN_PA25G_PDEC_QDI1                        _UINT32_(25)
#define MUX_PA25G_PDEC_QDI1                        _UINT32_(6) 
#define PINMUX_PA25G_PDEC_QDI1                     ((PIN_PA25G_PDEC_QDI1 << 16) | MUX_PA25G_PDEC_QDI1)
#define PORT_PA25G_PDEC_QDI1                       (_UINT32_(1) << 25)

#define PIN_PB22G_PDEC_QDI2                        _UINT32_(54)
#define MUX_PB22G_PDEC_QDI2                        _UINT32_(6) 
#define PINMUX_PB22G_PDEC_QDI2                     ((PIN_PB22G_PDEC_QDI2 << 16) | MUX_PB22G_PDEC_QDI2)
#define PORT_PB22G_PDEC_QDI2                       (_UINT32_(1) << 22)

/* ========== PORT definition for QSPI peripheral ========== */
#define PIN_PB11H_QSPI_CS                          _UINT32_(43)
#define MUX_PB11H_QSPI_CS                          _UINT32_(7) 
#define PINMUX_PB11H_QSPI_CS                       ((PIN_PB11H_QSPI_CS << 16) | MUX_PB11H_QSPI_CS)
#define PORT_PB11H_QSPI_CS                         (_UINT32_(1) << 11)

#define PIN_PA08H_QSPI_DATA0                       _UINT32_(8) 
#define MUX_PA08H_QSPI_DATA0                       _UINT32_(7) 
#define PINMUX_PA08H_QSPI_DATA0                    ((PIN_PA08H_QSPI_DATA0 << 16) | MUX_PA08H_QSPI_DATA0)
#define PORT_PA08H_QSPI_DATA0                      (_UINT32_(1) << 8)

#define PIN_PA09H_QSPI_DATA1                       _UINT32_(9) 
#define MUX_PA09H_QSPI_DATA1                       _UINT32_(7) 
#define PINMUX_PA09H_QSPI_DATA1                    ((PIN_PA09H_QSPI_DATA1 << 16) | MUX_PA09H_QSPI_DATA1)
#define PORT_PA09H_QSPI_DATA1                      (_UINT32_(1) << 9)

#define PIN_PA10H_QSPI_DATA2                       _UINT32_(10)
#define MUX_PA10H_QSPI_DATA2                       _UINT32_(7) 
#define PINMUX_PA10H_QSPI_DATA2                    ((PIN_PA10H_QSPI_DATA2 << 16) | MUX_PA10H_QSPI_DATA2)
#define PORT_PA10H_QSPI_DATA2                      (_UINT32_(1) << 10)

#define PIN_PA11H_QSPI_DATA3                       _UINT32_(11)
#define MUX_PA11H_QSPI_DATA3                       _UINT32_(7) 
#define PINMUX_PA11H_QSPI_DATA3                    ((PIN_PA11H_QSPI_DATA3 << 16) | MUX_PA11H_QSPI_DATA3)
#define PORT_PA11H_QSPI_DATA3                      (_UINT32_(1) << 11)

#define PIN_PB10H_QSPI_SCK                         _UINT32_(42)
#define MUX_PB10H_QSPI_SCK                         _UINT32_(7) 
#define PINMUX_PB10H_QSPI_SCK                      ((PIN_PB10H_QSPI_SCK << 16) | MUX_PB10H_QSPI_SCK)
#define PORT_PB10H_QSPI_SCK                        (_UINT32_(1) << 10)

/* ========== PORT definition for SDHC0 peripheral ========== */
#define PIN_PA06I_SDHC0_SDCD                       _UINT32_(6) 
#define MUX_PA06I_SDHC0_SDCD                       _UINT32_(8) 
#define PINMUX_PA06I_SDHC0_SDCD                    ((PIN_PA06I_SDHC0_SDCD << 16) | MUX_PA06I_SDHC0_SDCD)
#define PORT_PA06I_SDHC0_SDCD                      (_UINT32_(1) << 6)

