zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg41/pio/pic32cx1025sg41064.h
#define PIN_PA17E_TC2_WO1                          _UINT32_(17)
#define MUX_PA17E_TC2_WO1                          _UINT32_(4) 
#define PINMUX_PA17E_TC2_WO1                       ((PIN_PA17E_TC2_WO1 << 16) | MUX_PA17E_TC2_WO1)
#define PORT_PA17E_TC2_WO1                         (_UINT32_(1) << 17)

/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA18E_TC3_WO0                          _UINT32_(18)
#define MUX_PA18E_TC3_WO0                          _UINT32_(4) 
#define PINMUX_PA18E_TC3_WO0                       ((PIN_PA18E_TC3_WO0 << 16) | MUX_PA18E_TC3_WO0)
#define PORT_PA18E_TC3_WO0                         (_UINT32_(1) << 18)

#define PIN_PA14E_TC3_WO0                          _UINT32_(14)
#define MUX_PA14E_TC3_WO0                          _UINT32_(4) 
#define PINMUX_PA14E_TC3_WO0                       ((PIN_PA14E_TC3_WO0 << 16) | MUX_PA14E_TC3_WO0)
#define PORT_PA14E_TC3_WO0                         (_UINT32_(1) << 14)

#define PIN_PA15E_TC3_WO1                          _UINT32_(15)
#define MUX_PA15E_TC3_WO1                          _UINT32_(4) 
#define PINMUX_PA15E_TC3_WO1                       ((PIN_PA15E_TC3_WO1 << 16) | MUX_PA15E_TC3_WO1)
#define PORT_PA15E_TC3_WO1                         (_UINT32_(1) << 15)

#define PIN_PA19E_TC3_WO1                          _UINT32_(19)
#define MUX_PA19E_TC3_WO1                          _UINT32_(4) 
#define PINMUX_PA19E_TC3_WO1                       ((PIN_PA19E_TC3_WO1 << 16) | MUX_PA19E_TC3_WO1)
#define PORT_PA19E_TC3_WO1                         (_UINT32_(1) << 19)

/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PA22E_TC4_WO0                          _UINT32_(22)
#define MUX_PA22E_TC4_WO0                          _UINT32_(4) 
#define PINMUX_PA22E_TC4_WO0                       ((PIN_PA22E_TC4_WO0 << 16) | MUX_PA22E_TC4_WO0)
#define PORT_PA22E_TC4_WO0                         (_UINT32_(1) << 22)

#define PIN_PB08E_TC4_WO0                          _UINT32_(40)
#define MUX_PB08E_TC4_WO0                          _UINT32_(4) 
#define PINMUX_PB08E_TC4_WO0                       ((PIN_PB08E_TC4_WO0 << 16) | MUX_PB08E_TC4_WO0)
#define PORT_PB08E_TC4_WO0                         (_UINT32_(1) << 8)

#define PIN_PB12E_TC4_WO0                          _UINT32_(44)
#define MUX_PB12E_TC4_WO0                          _UINT32_(4) 
#define PINMUX_PB12E_TC4_WO0                       ((PIN_PB12E_TC4_WO0 << 16) | MUX_PB12E_TC4_WO0)
#define PORT_PB12E_TC4_WO0                         (_UINT32_(1) << 12)

#define PIN_PA23E_TC4_WO1                          _UINT32_(23)
#define MUX_PA23E_TC4_WO1                          _UINT32_(4) 
#define PINMUX_PA23E_TC4_WO1                       ((PIN_PA23E_TC4_WO1 << 16) | MUX_PA23E_TC4_WO1)
#define PORT_PA23E_TC4_WO1                         (_UINT32_(1) << 23)

#define PIN_PB09E_TC4_WO1                          _UINT32_(41)
#define MUX_PB09E_TC4_WO1                          _UINT32_(4) 
#define PINMUX_PB09E_TC4_WO1                       ((PIN_PB09E_TC4_WO1 << 16) | MUX_PB09E_TC4_WO1)
#define PORT_PB09E_TC4_WO1                         (_UINT32_(1) << 9)

#define PIN_PB13E_TC4_WO1                          _UINT32_(45)
#define MUX_PB13E_TC4_WO1                          _UINT32_(4) 
#define PINMUX_PB13E_TC4_WO1                       ((PIN_PB13E_TC4_WO1 << 16) | MUX_PB13E_TC4_WO1)
#define PORT_PB13E_TC4_WO1                         (_UINT32_(1) << 13)

/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA24E_TC5_WO0                          _UINT32_(24)
#define MUX_PA24E_TC5_WO0                          _UINT32_(4) 
#define PINMUX_PA24E_TC5_WO0                       ((PIN_PA24E_TC5_WO0 << 16) | MUX_PA24E_TC5_WO0)
#define PORT_PA24E_TC5_WO0                         (_UINT32_(1) << 24)

#define PIN_PB10E_TC5_WO0                          _UINT32_(42)
#define MUX_PB10E_TC5_WO0                          _UINT32_(4) 
#define PINMUX_PB10E_TC5_WO0                       ((PIN_PB10E_TC5_WO0 << 16) | MUX_PB10E_TC5_WO0)
#define PORT_PB10E_TC5_WO0                         (_UINT32_(1) << 10)

#define PIN_PB14E_TC5_WO0                          _UINT32_(46)
#define MUX_PB14E_TC5_WO0                          _UINT32_(4) 
#define PINMUX_PB14E_TC5_WO0                       ((PIN_PB14E_TC5_WO0 << 16) | MUX_PB14E_TC5_WO0)
#define PORT_PB14E_TC5_WO0                         (_UINT32_(1) << 14)

#define PIN_PA25E_TC5_WO1                          _UINT32_(25)
#define MUX_PA25E_TC5_WO1                          _UINT32_(4) 
#define PINMUX_PA25E_TC5_WO1                       ((PIN_PA25E_TC5_WO1 << 16) | MUX_PA25E_TC5_WO1)
#define PORT_PA25E_TC5_WO1                         (_UINT32_(1) << 25)

#define PIN_PB11E_TC5_WO1                          _UINT32_(43)
#define MUX_PB11E_TC5_WO1                          _UINT32_(4) 
#define PINMUX_PB11E_TC5_WO1                       ((PIN_PB11E_TC5_WO1 << 16) | MUX_PB11E_TC5_WO1)
#define PORT_PB11E_TC5_WO1                         (_UINT32_(1) << 11)

#define PIN_PB15E_TC5_WO1                          _UINT32_(47)
#define MUX_PB15E_TC5_WO1                          _UINT32_(4) 
#define PINMUX_PB15E_TC5_WO1                       ((PIN_PB15E_TC5_WO1 << 16) | MUX_PB15E_TC5_WO1)
#define PORT_PB15E_TC5_WO1                         (_UINT32_(1) << 15)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA20G_TCC0_WO0                         _UINT32_(20)
#define MUX_PA20G_TCC0_WO0                         _UINT32_(6) 
#define PINMUX_PA20G_TCC0_WO0                      ((PIN_PA20G_TCC0_WO0 << 16) | MUX_PA20G_TCC0_WO0)
#define PORT_PA20G_TCC0_WO0                        (_UINT32_(1) << 20)

#define PIN_PB12G_TCC0_WO0                         _UINT32_(44)
#define MUX_PB12G_TCC0_WO0                         _UINT32_(6) 
#define PINMUX_PB12G_TCC0_WO0                      ((PIN_PB12G_TCC0_WO0 << 16) | MUX_PB12G_TCC0_WO0)
#define PORT_PB12G_TCC0_WO0                        (_UINT32_(1) << 12)

#define PIN_PA08F_TCC0_WO0                         _UINT32_(8) 
#define MUX_PA08F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PA08F_TCC0_WO0                      ((PIN_PA08F_TCC0_WO0 << 16) | MUX_PA08F_TCC0_WO0)
#define PORT_PA08F_TCC0_WO0                        (_UINT32_(1) << 8)

#define PIN_PA21G_TCC0_WO1                         _UINT32_(21)
#define MUX_PA21G_TCC0_WO1                         _UINT32_(6) 
#define PINMUX_PA21G_TCC0_WO1                      ((PIN_PA21G_TCC0_WO1 << 16) | MUX_PA21G_TCC0_WO1)
#define PORT_PA21G_TCC0_WO1                        (_UINT32_(1) << 21)

#define PIN_PB13G_TCC0_WO1                         _UINT32_(45)
#define MUX_PB13G_TCC0_WO1                         _UINT32_(6) 
#define PINMUX_PB13G_TCC0_WO1                      ((PIN_PB13G_TCC0_WO1 << 16) | MUX_PB13G_TCC0_WO1)
#define PORT_PB13G_TCC0_WO1                        (_UINT32_(1) << 13)

