zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg41/pio/pic32cx1025sg41064.h
#define PIN_PA14G_TCC1_WO2                         _UINT32_(14)
#define MUX_PA14G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PA14G_TCC1_WO2                      ((PIN_PA14G_TCC1_WO2 << 16) | MUX_PA14G_TCC1_WO2)
#define PORT_PA14G_TCC1_WO2                        (_UINT32_(1) << 14)

#define PIN_PA18F_TCC1_WO2                         _UINT32_(18)
#define MUX_PA18F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PA18F_TCC1_WO2                      ((PIN_PA18F_TCC1_WO2 << 16) | MUX_PA18F_TCC1_WO2)
#define PORT_PA18F_TCC1_WO2                        (_UINT32_(1) << 18)

#define PIN_PA13G_TCC1_WO3                         _UINT32_(13)
#define MUX_PA13G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PA13G_TCC1_WO3                      ((PIN_PA13G_TCC1_WO3 << 16) | MUX_PA13G_TCC1_WO3)
#define PORT_PA13G_TCC1_WO3                        (_UINT32_(1) << 13)

#define PIN_PA15G_TCC1_WO3                         _UINT32_(15)
#define MUX_PA15G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PA15G_TCC1_WO3                      ((PIN_PA15G_TCC1_WO3 << 16) | MUX_PA15G_TCC1_WO3)
#define PORT_PA15G_TCC1_WO3                        (_UINT32_(1) << 15)

#define PIN_PA19F_TCC1_WO3                         _UINT32_(19)
#define MUX_PA19F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PA19F_TCC1_WO3                      ((PIN_PA19F_TCC1_WO3 << 16) | MUX_PA19F_TCC1_WO3)
#define PORT_PA19F_TCC1_WO3                        (_UINT32_(1) << 19)

#define PIN_PA08G_TCC1_WO4                         _UINT32_(8) 
#define MUX_PA08G_TCC1_WO4                         _UINT32_(6) 
#define PINMUX_PA08G_TCC1_WO4                      ((PIN_PA08G_TCC1_WO4 << 16) | MUX_PA08G_TCC1_WO4)
#define PORT_PA08G_TCC1_WO4                        (_UINT32_(1) << 8)

#define PIN_PA20F_TCC1_WO4                         _UINT32_(20)
#define MUX_PA20F_TCC1_WO4                         _UINT32_(5) 
#define PINMUX_PA20F_TCC1_WO4                      ((PIN_PA20F_TCC1_WO4 << 16) | MUX_PA20F_TCC1_WO4)
#define PORT_PA20F_TCC1_WO4                        (_UINT32_(1) << 20)

#define PIN_PA09G_TCC1_WO5                         _UINT32_(9) 
#define MUX_PA09G_TCC1_WO5                         _UINT32_(6) 
#define PINMUX_PA09G_TCC1_WO5                      ((PIN_PA09G_TCC1_WO5 << 16) | MUX_PA09G_TCC1_WO5)
#define PORT_PA09G_TCC1_WO5                        (_UINT32_(1) << 9)

#define PIN_PA21F_TCC1_WO5                         _UINT32_(21)
#define MUX_PA21F_TCC1_WO5                         _UINT32_(5) 
#define PINMUX_PA21F_TCC1_WO5                      ((PIN_PA21F_TCC1_WO5 << 16) | MUX_PA21F_TCC1_WO5)
#define PORT_PA21F_TCC1_WO5                        (_UINT32_(1) << 21)

#define PIN_PA10G_TCC1_WO6                         _UINT32_(10)
#define MUX_PA10G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PA10G_TCC1_WO6                      ((PIN_PA10G_TCC1_WO6 << 16) | MUX_PA10G_TCC1_WO6)
#define PORT_PA10G_TCC1_WO6                        (_UINT32_(1) << 10)

#define PIN_PA22F_TCC1_WO6                         _UINT32_(22)
#define MUX_PA22F_TCC1_WO6                         _UINT32_(5) 
#define PINMUX_PA22F_TCC1_WO6                      ((PIN_PA22F_TCC1_WO6 << 16) | MUX_PA22F_TCC1_WO6)
#define PORT_PA22F_TCC1_WO6                        (_UINT32_(1) << 22)

#define PIN_PA11G_TCC1_WO7                         _UINT32_(11)
#define MUX_PA11G_TCC1_WO7                         _UINT32_(6) 
#define PINMUX_PA11G_TCC1_WO7                      ((PIN_PA11G_TCC1_WO7 << 16) | MUX_PA11G_TCC1_WO7)
#define PORT_PA11G_TCC1_WO7                        (_UINT32_(1) << 11)

#define PIN_PA23F_TCC1_WO7                         _UINT32_(23)
#define MUX_PA23F_TCC1_WO7                         _UINT32_(5) 
#define PINMUX_PA23F_TCC1_WO7                      ((PIN_PA23F_TCC1_WO7 << 16) | MUX_PA23F_TCC1_WO7)
#define PORT_PA23F_TCC1_WO7                        (_UINT32_(1) << 23)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PA14F_TCC2_WO0                         _UINT32_(14)
#define MUX_PA14F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA14F_TCC2_WO0                      ((PIN_PA14F_TCC2_WO0 << 16) | MUX_PA14F_TCC2_WO0)
#define PORT_PA14F_TCC2_WO0                        (_UINT32_(1) << 14)

#define PIN_PA30F_TCC2_WO0                         _UINT32_(30)
#define MUX_PA30F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA30F_TCC2_WO0                      ((PIN_PA30F_TCC2_WO0 << 16) | MUX_PA30F_TCC2_WO0)
#define PORT_PA30F_TCC2_WO0                        (_UINT32_(1) << 30)

#define PIN_PA15F_TCC2_WO1                         _UINT32_(15)
#define MUX_PA15F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PA15F_TCC2_WO1                      ((PIN_PA15F_TCC2_WO1 << 16) | MUX_PA15F_TCC2_WO1)
#define PORT_PA15F_TCC2_WO1                        (_UINT32_(1) << 15)

#define PIN_PA31F_TCC2_WO1                         _UINT32_(31)
#define MUX_PA31F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PA31F_TCC2_WO1                      ((PIN_PA31F_TCC2_WO1 << 16) | MUX_PA31F_TCC2_WO1)
#define PORT_PA31F_TCC2_WO1                        (_UINT32_(1) << 31)

#define PIN_PA24F_TCC2_WO2                         _UINT32_(24)
#define MUX_PA24F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PA24F_TCC2_WO2                      ((PIN_PA24F_TCC2_WO2 << 16) | MUX_PA24F_TCC2_WO2)
#define PORT_PA24F_TCC2_WO2                        (_UINT32_(1) << 24)

#define PIN_PB02F_TCC2_WO2                         _UINT32_(34)
#define MUX_PB02F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PB02F_TCC2_WO2                      ((PIN_PB02F_TCC2_WO2 << 16) | MUX_PB02F_TCC2_WO2)
#define PORT_PB02F_TCC2_WO2                        (_UINT32_(1) << 2)

/* ========== PORT definition for TCC3 peripheral ========== */
#define PIN_PB12F_TCC3_WO0                         _UINT32_(44)
#define MUX_PB12F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PB12F_TCC3_WO0                      ((PIN_PB12F_TCC3_WO0 << 16) | MUX_PB12F_TCC3_WO0)
#define PORT_PB12F_TCC3_WO0                        (_UINT32_(1) << 12)

