zephyrproject-rtos/hal_microchip/pic32c/pic32cxsg/include/pic32cxsg41/pio/pic32cx1025sg41064.h
#define PIN_PB16F_TCC3_WO0                         _UINT32_(48)
#define MUX_PB16F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PB16F_TCC3_WO0                      ((PIN_PB16F_TCC3_WO0 << 16) | MUX_PB16F_TCC3_WO0)
#define PORT_PB16F_TCC3_WO0                        (_UINT32_(1) << 16)

#define PIN_PB13F_TCC3_WO1                         _UINT32_(45)
#define MUX_PB13F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PB13F_TCC3_WO1                      ((PIN_PB13F_TCC3_WO1 << 16) | MUX_PB13F_TCC3_WO1)
#define PORT_PB13F_TCC3_WO1                        (_UINT32_(1) << 13)

#define PIN_PB17F_TCC3_WO1                         _UINT32_(49)
#define MUX_PB17F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PB17F_TCC3_WO1                      ((PIN_PB17F_TCC3_WO1 << 16) | MUX_PB17F_TCC3_WO1)
#define PORT_PB17F_TCC3_WO1                        (_UINT32_(1) << 17)

/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PB14F_TCC4_WO0                         _UINT32_(46)
#define MUX_PB14F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PB14F_TCC4_WO0                      ((PIN_PB14F_TCC4_WO0 << 16) | MUX_PB14F_TCC4_WO0)
#define PORT_PB14F_TCC4_WO0                        (_UINT32_(1) << 14)

#define PIN_PB30F_TCC4_WO0                         _UINT32_(62)
#define MUX_PB30F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PB30F_TCC4_WO0                      ((PIN_PB30F_TCC4_WO0 << 16) | MUX_PB30F_TCC4_WO0)
#define PORT_PB30F_TCC4_WO0                        (_UINT32_(1) << 30)

#define PIN_PB15F_TCC4_WO1                         _UINT32_(47)
#define MUX_PB15F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PB15F_TCC4_WO1                      ((PIN_PB15F_TCC4_WO1 << 16) | MUX_PB15F_TCC4_WO1)
#define PORT_PB15F_TCC4_WO1                        (_UINT32_(1) << 15)

#define PIN_PB31F_TCC4_WO1                         _UINT32_(63)
#define MUX_PB31F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PB31F_TCC4_WO1                      ((PIN_PB31F_TCC4_WO1 << 16) | MUX_PB31F_TCC4_WO1)
#define PORT_PB31F_TCC4_WO1                        (_UINT32_(1) << 31)

/* ========== PORT definition for USB peripheral ========== */
#define PIN_PA24H_USB_DM                           _UINT32_(24)
#define MUX_PA24H_USB_DM                           _UINT32_(7) 
#define PINMUX_PA24H_USB_DM                        ((PIN_PA24H_USB_DM << 16) | MUX_PA24H_USB_DM)
#define PORT_PA24H_USB_DM                          (_UINT32_(1) << 24)

#define PIN_PA25H_USB_DP                           _UINT32_(25)
#define MUX_PA25H_USB_DP                           _UINT32_(7) 
#define PINMUX_PA25H_USB_DP                        ((PIN_PA25H_USB_DP << 16) | MUX_PA25H_USB_DP)
#define PORT_PA25H_USB_DP                          (_UINT32_(1) << 25)

#define PIN_PA23H_USB_SOF_1KHZ                     _UINT32_(23)
#define MUX_PA23H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PA23H_USB_SOF_1KHZ                  ((PIN_PA23H_USB_SOF_1KHZ << 16) | MUX_PA23H_USB_SOF_1KHZ)
#define PORT_PA23H_USB_SOF_1KHZ                    (_UINT32_(1) << 23)

#define PIN_PB22H_USB_SOF_1KHZ                     _UINT32_(54)
#define MUX_PB22H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PB22H_USB_SOF_1KHZ                  ((PIN_PB22H_USB_SOF_1KHZ << 16) | MUX_PB22H_USB_SOF_1KHZ)
#define PORT_PB22H_USB_SOF_1KHZ                    (_UINT32_(1) << 22)



#endif /* _PIC32CX1025SG41064_GPIO_H_ */

